# Taps
tap "koekeishiya/formulae"
tap "cantino/mcfly"
tap "oven-sh/bun"

# CLI tools
brew "atool"
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "highlight"
brew "jq"
brew "jesseduffield/lazygit/lazygit"
brew "neovim"
brew "tree-sitter-cli"
brew "ripgrep"
brew "yazi"
brew "ffmpegthumbnailer"
brew "poppler"
brew "git-delta"
brew "starship"
brew "fastfetch"
brew "zoxide"
brew "mise"
brew "jenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "thefuck"
brew "cantino/mcfly/mcfly"
brew "telnet"
brew "sesh"
brew "tmux"
brew "gh"
brew "uv"
brew "oven-sh/bun/bun"
brew "chafa"
brew "mitmproxy"
brew "openjdk@17"

# macOS window management
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# GUI applications
cask "alacritty"
cask "ghostty"
cask "font-hack-nerd-font"
cask "font-lxgw-wenkai"
cask "stats"
cask "raycast"
cask "visual-studio-code"
cask "spotify"
cask "squirrel-app"
cask "font-symbols-only-nerd-font"
cask "obsidian"
